#რა არის conditional statements
#პროგრამირების ერთერთი ძირითადი კონცეფციაა.ისინი ეხმარება პროგრამას მიიღოს გადაწყვეტილება: თუ კონკრეტული პირობა (მართალია)მაშინ გარკვეული 
#მოქმედება უნდა მოხდეს. თუ პირობა არ შესრულდება (არ არის მართალი)შეიძლება სხვა მოქმედება განხორციელდეს

# პროგრამირებაში "if" არის სინტაქსის ნაწილი,if ერთ-ერთი ყველაზე მნიშვნელოვანი კონსტრუქცია, რომელიც გამოიყენება პროგრამის ლოგიკის განხორციელებისთვის.
# "if" statement (ან "if"-განცხადება) საშუალებას გვაძლევს შევამოწმოთ გარკვეული პირობა და მხოლოდ მაშინ შევასრულოთ კოდის გარკვეული ნაწილი,
#  თუ ეს პირობა ჭეშმარიტია

#„elif“ არის Python-ის პროგრამირების ენის კონსტრუქტი, რომელიც წარმოადგენს „else if“-ის კომბინაციას. ეს გამოიყენება, როდესაც გვსურს
#  შევამოწმოთ რამდენიმე პირობა ერთდროულად და ერთ-ერთი მათგანის შეუსრულებლობის შემთხვევაში გადავიდეთ შემდეგ პირობაში.
#გაითვალისწინე, რომ elif-ის გამოყენებისას, თუ პირველი პირობა (თუ if-ი) არ შესრულდა, ხდება შემდეგი პირობის შემოწმება




# ასაკის განსაზღვრა
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს ასაკის შეყვანას და შემდეგ განსაზღვრავს, არის თუ არა ადამიანი მცირეწლოვანი, მოზარდი თუ ზრდასრული.

 
# ინსტრუქციები:
# თუ ასაკი 13-ზე ნაკლებია, დაბეჭდე „მცირეწლოვანი“.
# თუ ასაკი 13-დან 19-მდეა, დაბეჭდე „მოზარდი“.
# თუ ასაკი 20-ზე მეტია, დაბეჭდე „ზრდასრული“.

age = int(input('Enter your age: '))

if age < 13:
    print('მცირეწლოვანი')
elif age > 13 and age < 19:
    print('მოზარდი')
elif age > 20:
    print('ზრდასრული')

