გამოიტანეთ  ლუწი რიცხვიები  1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)

for number in range(2, 51, 2):
    print(number)
  print(number)

  შექმენით for ციკლი, რომელიც გამოიანგარიშებს 0-დან 10-მდე ყველა რიცხვის ჯამს, ხოლო for ციკლის დასრულების შემდეგ დაბეჭდეთ ჯამი

  # ჯამის თავიდან დაწყება
  total_sum = 0
  
  # for loop, რომელიც გადის 0-დან 10-მდე რიცხვებზე
  for number in range(11):  # range(11) შექმნის რიცხვებს 0-დან 10-მდე
      total_sum += number  # რიცხვის დამატება ჯამში
  
  # დაბეჭდვა ჯამის
  print("0-დან 10-მდე რიცხვების ჯამი:", total_sum)

გამოიტანეთ რიცხვების თანმიმდევრობა საპირისპირო მიმართულებით 100 - დან, 0 - მდე ,for loop გამოყენებით(100, 99, 98 და ა.შ)

# for loop, რომელიც გადის რიცხვებზე 100-დან 0-მდე
for number in range(100, -1, -1):  # იწყება 100-დან და ვგრძელებთ 0-მდე (0 შედის)
    print(number)

გამოიტანეთ  კენტი რიცხვიები  1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)

# for loop-ის გამოყენება კენტი რიცხვების დასაბეჭდად
for number in range(1, 51, 2):  # range(1, 51, 2) იწყება 1-ით და გადავა ყოველ 2 რიცხვზე
    print(number)
