function syncOne() {
  console.log("SyncOne დასრულდა");
}

function syncTwo() {
  console.log("SyncTwo დასრულდა");
}



async function A(){
    resolve => {
    setTimeout(() => console.log("A დასრულდა"),
     2000);
  };
}

async function B() {
    resolve => {
    setTimeout(() => console.log("B დასრულდა"), 
    1000);
  };
}

// პირველი დასრულდება ის, ვისაც ნაკლები დრო აქვს მითითებული (აქ 1 წამი):
//1 წამში დასრულებული (asyncTwo) პირველ რიგში გადმოვა task queue–ში და მერე stack–ში.

//მეორე დასრულდება ის, ვინც უფრო დიდხანს ელოდება (აქ 2 წამი):

//იმიტომ, რომ  მისი ტაიმერი უფრო გვიან ამოიწურება.

//ამიტომ მისი შედეგი მხოლოდ 2 წამში გადმოვა task queue–ში  მერე stack-ში  და შესრულდება. 

//AsyncTwo მოდის პირველი, რადგან 1 წამში ტაიმერი უფრო მალე ამოიწურა.

//AsyncOne მოდის მეორე, რადგან 2 წამს ელოდებოდა და მოგვიანებით დაბრუნდა.


