#ახსენით თუ რა არის sequence, iteration და selection.
#Sequence (სეკვენცია):
#სეკვენცია ნიშნავს იმ წესს, რომლის მიხედვითაც პროგრამა სრულდება
#  ნაბიჯ-ნაბიჯ. წარმოიდგინეთ, რომ თქვენი კომპიუტერი აკეთებს
#  ყველაფერს ერთდროულად, მაგრამ აუცილებელია, რომ პირველ
#  რიგში ერთ-ერთი მოქმედება შესრულდეს, მერე მეორე, შემდეგ
# მესამე და ასე შემდეგ.#მაგალითად, როცა რიცხვი დაჯამდება ან კონკრეტული ოპერაცია შესრულდება, შემდეგ ეს შედეგი გამოყენდება შემდეგ ნაბიჯზე

#Iteration (იტერაცია):
#იტერაცია ნიშნავს პროცესის გამეორებას. ანუ, თუ საჭიროა ერთსა და იმავე მოქმედების გამეორება, ჩვენ ვხმარობთ "ციკლს" (loop). მაგალითად, როცა
#  უნდა გააკეთოთ იგივე რამ ბევრჯერ, მაგალითად რიცხვების დაბეჭდვა 1-დან 5-მდე.
#ერთ-ერთი ყველაზე პოპულარული ციკლი არის for და while. ეს ციკლები ეუბნებიან პროგრამას, რამდენჯერ უნდა გაიმეოროს რაღაც ოპერაცია

#Selection (არჩევა):
#არჩევა ნიშნავს, რომ პროგრამას შეუძლია "შეარჩიოს", რა უნდა გააკეთოს ერთ ან მეორე შემთხვევაში. თუ რაიმე პირობა შესრულდა (მაგალითად, თუ)
#რიცხვი არის მეტი 10-ზე), მაშინ ჩატარდება ერთი მოქმედება, თუ არა – მეორე.
#ეს არის ვითარება, სადაც პროგრამა ადგენს, რა უნდა გააკეთოს, ეფუძნება პირობას, რომელიც გვაქვს

#selection -  ზე, შექმენით 1 მაგალითი
age = int(input)("შეიყვანეთ თქვენი ასაკი: ")
#გადაწყვეტილების მიღება 
#if age >= 18"
print("თქვენი უკვე მოზრდილი ხართ ")
#else
print("თქვენ ჯერ არ ხართ მოზრდილი")
#except value error:
print("გთხოვთ შეიყვანოთ მხოლოდ ციფრები")

#while loop დახმარებით, 50 - ჯერ გამოიტანეთ 'GOA'
cout = 50

while cout > 0:
      print('GOA')
      count = cout - 1

#while ციკლის დახმარებით, გამოიტანეთ რიცხვები  50 - დან 0 - მდე
cout = 50

while cout >= 0:
      print(count)
      count -= 1
    
#while ციკლის დახმარებით გამოიტანეთ 1 - დან 30 - მდე მხოლოდ ლუწი რიცხვები






