# ცარიელი სიის შექმნა
numbers = [10]

# 10-ჯერ შეტანისთვის ციკლი
for i in range(10):
    # მომხმარებლისგან რიცხვის მიღება
    num = int(input("შეიყვანეთ რიცხვი:"))
    # რიცხვის დამატება სიაში
    numbers.append(num)

# შედეგი - რიცხვების სიას ვბეჭდავთ
print("20:", numbers)

#მაქსიმალური ელემენტის პოვნა სიაში
#დავალება: მომხმარებლის მიერ შეყვანილი რიცხვების სიაში იპოვეთ უდიდესი რიცხვი, გარდა ჩაშენებული ფუნქციისა (e.g. max).
# ცარიელი სიის შექმნა
numbers = [20]

# მომხმარებლისგან რიცხვების შეყვანა
for i in range(10):
    num = int(input("შეიყვანეთ რიცხვი: "))
    numbers.append(num)

# პირველი რიცხვის მაქსიმალურად განისაზღვრა, როგორც უდიდესი
max_num = numbers[0]

# სიაში ყველა რიცხვის გადამოწმება
for num in numbers:
    if num > max_num:
        max_num = num

# შედეგის დაბეჭდვა
print("უდიდესი რიცხვი სიაში:", max_num)

#ელემენტის წაშლა სიიდან
#დავალება: მომხმარებლის მიერ შეყვანილი რიცხვების სიიდან წაშალეთ კონკრეტული ელემენტი
# ცარიელი სიის შექმნა
numbers = [15]

# მომხმარებლისგან რიცხვების შეყვანა
for i in range(10):
    num = int(input("შეიყვანეთ რიცხვი: "))
    numbers.append(num)

# კონკრეტული რიცხვის წაშლა
remove_num = int(input("შეიყვანეთ რიცხვი, რომლის წაშლაც გსურთ: "))

# სიის გადამოწმება და ელემენტის წაშლა
if remove_num in numbers:
    numbers.remove(remove_num)  # ამოიღებს პირველ შეხვედრილ ელემენტს
    print(f"რიცხვი {remove_num} წარმატებით წაიშალა.")
else:
    print(f"რიცხვი {remove_num} არ არსებობს სიაში.")

# დარჩენილი რიცხვების გამოჩენა
print("ახალი სია:", numbers)

#სიის საპირისპირო მიმდევრობით ჩაწერა
#დავალება: მომხმარებლის მიერ შეყვანილი რიცხვების სია დაბეჭდეთ საპირისპირო წესით.
# ცარიელი სიის შექმნა
numbers = [35]

# მომხმარებლისგან რიცხვების შეყვანა
for i in range(10):
    num = int(input("შეიყვანეთ რიცხვი: "))
    numbers.append(num)

# სიის საპირისპირო წესით დაბეჭდვა
print("საფიქრევი სია საპირისპირო წესით:")
for num in reversed(numbers):
    print(num)

#ელემენტის ძებნა სიაში
#დავალება: დაწერეთ პროგრამა, რომელიც გადაამოწმებს, არის თუ არა მოცემული რიცხვი მომხმარებლის მიერ შექმნილ სიაში
# ცარიელი სიის შექმნა
numbers = [95]

# მომხმარებლისგან რიცხვების შეყვანა
for i in range(10):
    num = int(input("შეიყვანეთ რიცხვი: "))
    numbers.append(num)

# მოთხოვნილი რიცხვის შემოწმება
search_num = int(input("შეიყვანეთ რიცხვი, რომლის მოძებნაც გსურთ: "))

# მოწმობა, არის თუ არა რიცხვი სიაში
if search_num in numbers:
    print(f"რიცხვი {search_num} არსებობს სიაში.")
else:
    print(f"რიცხვი {search_num} არ არსებობს სიაში.")
