#შექმენით ფუნქცია, სადაც შემოიტანთ თქვენს თავზე ინფორმაცია, სახელი, გვარი, ასაკი, ქვეყანა, ქალაქი, საყვარელი ჰობი და ა.შ
def about_me():
    name = "davit gogilashvili"
    surname = "gogilashvili"
    age = 10  # წლის ასაკი, როგორც მოდელი
    country = "georgia"
    city = "tbilisi"
    favorite_hobby = "writing code"
    favorite_food = "mwvadi"
    dream = "my dream is become mentor"

    print(f"მცირე ინფორმაცია ჩემზე:\n"
          f"სახელი: (დათა)\n"
          f"გვარი: (გოგილაშვილი)\n"
          f"ასაკი: (10) წლის\n"
          f"ქვეყანა: (საქართველო)\n"
          f"ქალაქი: (თბილისი)\n"
          f"საყვარელი ჰობი: (კოდის წერა)\n"
          f"საყვარელი საკვები: (მწვადი)\n"
          f"მინდორში ოცნება: (ჩემი ოცნებაა გავხდე მენტორი))")

# ფუნქციის გამოსაწვდომი მაგალითი:
about_me()



#განსაზღვრეთ ფუნქცია სახელწოდებით simple_calculator, რომელიც იღებს სამ არგუმენტს:
#num1: პირველი რიცხვი (მთლიანი ან float).
#num2: მეორე რიცხვი (მთლიანი ან float).

#ოპერაცია: სტრიქონი, რომელიც განსაზღვრავს შესასრულებლად ოპერაციას. ის შეიძლება იყოს „დამატება“, „გამოკლება“, „გამრავლება“ ან „გაყოფა“.
#ფუნქციის შიგნით,

#გამოიყენეთ if და elif განცხადებები, რათა დაადგინოთ რომელი ოპერაცია უნდა შეასრულოთ ოპერაციის არგუმენტის მნიშვნელობიდან გამომდინარე.

#ფუნქციამ უნდა დააბრუნოს ოპერაციის შედეგი.

#თუ ოპერაცია არის „გაყოფა“ და num2 არის 0, ფუნქციამ უნდა დააბრუნოს „შეცდომა: ნულზე გაყოფა შეუძლებელია“.
#ჩაწერეთ კოდი, რომ გამოიძახოთ ფუნქცია სხვადასხვა ოპერაციებით და დაბეჭდოთ შედეგები
def simple_calculator(num1, num2, operation):
    if operation == "დამატება":
        return num1 + num2
    elif operation == "გამოკლება":
        return num1 - num2
    elif operation == "გამრავლება":
        return num1 * num2
    elif operation == "გაყოფა":
        if num2 == 0:
            return "შეცდომა: ნულზე გაყოფა შეუძლებელია"
        else:
            return num1 / num2
    else:
        return "შეცდომა: არასწორი ოპერაცია"

# ფუნქციის გამოსაწვდომი მაგალითები:

# დამატება
result = simple_calculator(10, 5, "დამატება")
print(result)  # გამოდის: 15

# გამოკლება
result = simple_calculator(10, 5, "გამოკლება")
print(result)  # გამოდის: 5

# გამრავლება
result = simple_calculator(10, 5, "გამრავლება")
print(result)  # გამოდის: 50

# გაყოფა
result = simple_calculator(10, 5, "გაყოფა")
print(result)  # გამოდის: 2.0

# გაყოფა ნულზე
result = simple_calculator(10, 0, "გაყოფა")
print(result)  # გამოდის: შეცდომა: ნულზე გაყოფა შეუძლებელია

# არასწორი ოპერაცია
result = simple_calculator(10, 5, "mod")
print(result)  # გამოდის: შეცდომა: არასწორი ოპერაცია




