let სახელი = "დათა";
let ასაკი = 10;
let ქალაქი = "თბილისი";

const ქვეყანა = "საქართველო";
const ფერი = "წითელი";
const ენები = ["ქართული", "ინგლისური"];

// ახსნა:
// let გამოიყენება მაშინ, როცა გვსურს ცვლადს მომავალში შევუცვალოთ მნიშვნელობა.

// const გამოიყენება მაშინ, როცა გვსურს ცვლადის მნიშვნელობა უცვლელი დარჩეს.

/* 
განსხვავება let და const შორის:
- let-ის მნიშვნელობა შეიძლება შეიცვალოს.
- const-ის მნიშვნელობა არ შეიძლება შეიცვალოს ერთჯერ გამოცხადების შემდეგ.
- ორივე მოქმედებს ბლოკის დონეზე (block-scoped).
*/
