print (10+1)
print (10+1)
print (10+2)
print (10+10)
print (10+30)
print (10+20)
print (70+40)
print (10+50)
print (20+60)
print (30+90)
print (40+5)
print (90+70)
print (80+90)
print (30+90)
print (100+100)

# Bud არის პროგრამულ უზრუნველყოფაში არსებული შდცდომა ან პრობლემა რო ელიც ხელს უშლის მისი ნორმალური ფუნქციონერის შესრულებას.ეს 
# შეიძლება იყოსარასწორი კოდი, ვერსიის შეუთავსებლობა ან სხვა ფაქტორები

# debigging არის პროცესი რომლის შეუთავსელობაც გამოვლინდება და გასწორდება ბაგები ეს პროცესში შემოდის კოდის ანალიზი ტესტირებადა ცვლილებების 
# განხორციელება რათა პროგრამა მუშაობდეს debugging-ი ხშირადმოიცავს ლოგირების ბრეიკფოინტების გამოყენებისა და სხვა და სხვა ინსტრუმენტების გამოყენებას.

