#game development: ეს ეხება ვიდეო თამაშების შექმნას. მოიცავს პროგრამირებას, დიზაინს,გრაფიკას დამასალების შექმნას. ჩვეულებრივ იყენებენ ენებს
#  როგორიცაა C# (Unity-სთვის) და  C++(Unreal engine-სთვის).


#AI ზე მუშაობა მოიცავს პროგრამირების შექმნას,რომელიცადამიანის მსგავსი გადაწყვეტილების მიღევის უნარს ფლობენ. გამოიყენება თამაშებში NPC-ების
# ინტელრქტის  გაუმჯობესებისთვის, ასევე რიცხვით მონაცემების ანალიზებისთვის და ავტომატური სწავლებისთვის.


 #web development ეს სპერო ეხება ვებსაიტებსა და ვებსატელიტების შექმნას  მოიცავს front-end (HTML, CSS, JAVASCRIPT) და back end (PHP PYTHON, RUBY)
 #განვითარებისუნარებს. ვებსაიტების ინტერაქცია დაბფუნქციონირება სწორედ აქედან გსმომდინარეობს


 #front end 

#ესვარის მომხმარებელისთვის ხილური ნაწილი,ანუ ის, რაც ეკრანზე ჩნდება.

#მოიცავს დიზაინს, ინტერფეიის და მომხმარებლის გამოცდილებას. 

#ტექნოლოგიები:HMTL(სტრუქტურა),css (დიზაინი) და javascript (ინტერაქტივობა).

#front-end დეველოპერები პასუხისმგებელნი არიან ვებსაიტების ვიზუალურად მიმზიდველი და გამოყენებადობისთვის მარტივი შესაქმნელად

#back-End
#ეს არის ვებსაიტების ან აპლიკაციების სერვერული მხარე, რაც მომხმარებლებსარ ჩანს.
#მოიცავს მონაცემთა ბაზების მართვას,სერვერის ლოგიკას api-ების ინტეგრაციას.
#ტექნოლოგიები: PHP, Python,ruby,java, node.js და მონაცემთა ბაზები, როგორიცაა My SQL, mongo.Db.

#back-end დეველოპერები პასუხისმგებლები არიან სერვერის ფუნქციორების, მონაცემების შენახვის დაბმიღების პროცესზე