#შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს

import random
# შეარჩიეთ შემთხვევითი რიცხვი 1-დან 10-მდე
target_number = random.randint(1, 10)

# დავიწყოთ while ციკლი
while True:
    # შეკითხვას ვუკეთებთ მომხმარებელს
    guess = int(input("იცნობ რიცხვს 1-დან 10-მდე? შეიყვანეთ თქვენი ვარაუდი: "))
    
    # შევამოწმოთ, დაემთხვა თუ არა რიცხვი
    if guess == target_number:
        print("ბრავო! შენ გამოიცანით სწორი რიცხვი: {target_number}")
        break  # რომ გავაჩეროთ ციკლი
    else:
        print("არასწორია, სცადეთ კიდევ.")

#while ციკლის საშვალებით გამოიტანეთ 1-იდან 100-მდე ყველა 5-ის ჯერადი რიცხვი

# While loop for printing multiples of 5 from 1 to 100
number = 5
while number <= 100:
    print(number)
    number += 5

#while ციკლისა და input-ის საშვალებით მომხარებელს შემოატანინეთ პაროლი სანამ არ იქნება ის "group55"-ის ტოლი

# პაროლის ვერსია, რომელიც მომხმარებელს უნდა შეიყვანოს
correct_password = "group55"

# while ციკლი, რომელიც მომხმარებელს ითხოვს პაროლის შეყვანას
while True:
    # მომხმარებლის შეყვანა
    entered_password = input("შეიყვანეთ პაროლი: ")
    
    # თუ პაროლი სწორია, სთქვით რომ შეყვანილია სწორი პაროლი და დაამთავრეთ ციკლი
    if entered_password == correct_password:
        print("პაროლი სწორია! დაუშვით სისტემაში.")
        break  # ციკლის გაჩერება
    else:
        print("არასწორი პაროლი. სცადეთ კვლავ")

