#შექმენით ფუნქცია, რომელიც გამოიტანს x და y ჯამს, მოახდინეთ ოპერაცია შემდეგ ოპერატორებზე: +, -. *. //
def sum(x, y):
     print(x + y)

sum(30, 40)

def plus():
     print(15+10)

def minus():
     print(30-25)

def multyply():
     print(35*3)

def multyply():
    print(44/2)


#შექმენით ფუნქცია, რომელიც მიესალმება მომხმარებელს.
#ტექსტი: 'გამარჯობა {სახელი}, კეთილი იყოს შენი მობრძანება,  გისურვებ წარმატებას და წინ სვლას"

def greet_user(name):
    print(f'გამარჯობა {name}, კეთილი იყოს შენი მობრძანება, გისურვებ წარმატებას და წინ სვლას')


#შექმენით ფუნქცია, რომელიც სიყვარულის წერილს მიუძღვნის მომხმარებელს:
#ტექსტი თქვენ მოიფიქრეთ.

#ტექსტის ბოლოს აუცილებლად ჩაამატეთ ეს ნაწილი: 'სიყვარულით {სახელი}'

def love_letter(name):
    print("ყველა დღე შენზე ფიქრით იწყება და შენზე ფიქრით სრულდება. შენ ხარ ის, რაც ჩემს გულს სჭირდება, "
     "იმისათვის რომ ცხოვრება გაალამაზო და მასში სითბო და სიკეთე შეიტანო. "
     "შენი თითოეული ღიმილი ჩემთვის სამყაროა, შენი სილამაზე კი უსასრულოა. "
     "შენთვის ყველა სიტყვა მწერლის ხელით დაწერილ პოეზიას ჰგავს, "
     "რომელიც ჩემს გულში ფერწერად ტრიალებს. "
     "ყოველი წამი შენთან ერთად საოცარია, და მინდა ეს წამები არასოდეს დასრულდეს.\n"
     "სიყვარულით {დავით გოგილაშვილი}")





